FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/pio/pio_samv71q21.h
/* ========== Pio definition for HSMCI peripheral ========== */
#define PIO_PA28C_MCCDA              ( 1u << 28 ) /**< \brief Hsmci signal: MCCDA */
#define PIO_PA25D_MCCK               ( 1u << 25 ) /**< \brief Hsmci signal: MCCK */
#define PIO_PA30C_MCDA0              ( 1u << 30 ) /**< \brief Hsmci signal: MCDA0 */
#define PIO_PA31C_MCDA1              ( 1u << 31 ) /**< \brief Hsmci signal: MCDA1 */
#define PIO_PA26C_MCDA2              ( 1u << 26 ) /**< \brief Hsmci signal: MCDA2 */
#define PIO_PA27C_MCDA3              ( 1u << 27 ) /**< \brief Hsmci signal: MCDA3 */
/* ========== Pio definition for ISI peripheral ========== */
#define PIO_PD22D_ISI_D0             ( 1u << 22 ) /**< \brief Isi signal: ISI_D0 */
#define PIO_PD21D_ISI_D1             ( 1u << 21 ) /**< \brief Isi signal: ISI_D1 */
#define PIO_PD30D_ISI_D10            ( 1u << 30 ) /**< \brief Isi signal: ISI_D10 */
#define PIO_PD31D_ISI_D11            ( 1u << 31 ) /**< \brief Isi signal: ISI_D11 */
#define PIO_PB3D_ISI_D2              ( 1u << 3 )  /**< \brief Isi signal: ISI_D2 */
#define PIO_PA9B_ISI_D3              ( 1u << 9 )  /**< \brief Isi signal: ISI_D3 */
#define PIO_PA5B_ISI_D4              ( 1u << 5 )  /**< \brief Isi signal: ISI_D4 */
#define PIO_PD11D_ISI_D5             ( 1u << 11 ) /**< \brief Isi signal: ISI_D5 */
#define PIO_PD12D_ISI_D6             ( 1u << 12 ) /**< \brief Isi signal: ISI_D6 */
#define PIO_PA27D_ISI_D7             ( 1u << 27 ) /**< \brief Isi signal: ISI_D7 */
#define PIO_PD27D_ISI_D8             ( 1u << 27 ) /**< \brief Isi signal: ISI_D8 */
#define PIO_PD28D_ISI_D9             ( 1u << 28 ) /**< \brief Isi signal: ISI_D9 */
#define PIO_PD24D_ISI_HSYNC          ( 1u << 24 ) /**< \brief Isi signal: ISI_HSYNC */
#define PIO_PA24D_ISI_PCK            ( 1u << 24 ) /**< \brief Isi signal: ISI_PCK */
#define PIO_PD25D_ISI_VSYNC          ( 1u << 25 ) /**< \brief Isi signal: ISI_VSYNC */
/* ========== Pio definition for MCAN0 peripheral ========== */
#define PIO_PB3A_CANRX0              ( 1u << 3 )  /**< \brief Mcan0 signal: CANRX0 */
#define PIO_PB2A_CANTX0              ( 1u << 2 )  /**< \brief Mcan0 signal: CANTX0 */
/* ========== Pio definition for MCAN1 peripheral ========== */
#define PIO_PC12C_CANRX1             ( 1u << 12 ) /**< \brief Mcan1 signal: CANRX1 */
#define PIO_PD28B_CANRX1             ( 1u << 28 ) /**< \brief Mcan1 signal: CANRX1 */
#define PIO_PC14C_CANTX1             ( 1u << 14 ) /**< \brief Mcan1 signal: CANTX1 */
#define PIO_PD12B_CANTX1             ( 1u << 12 ) /**< \brief Mcan1 signal: CANTX1 */
/* ========== Pio definition for MLB peripheral ========== */
#define PIO_PB4C_MLBCLK              ( 1u << 4 )  /**< \brief Mlb signal: MLBCLK */
#define PIO_PB5C_MLBDAT              ( 1u << 5 )  /**< \brief Mlb signal: MLBDAT */
#define PIO_PD10D_MLBSIG             ( 1u << 10 ) /**< \brief Mlb signal: MLBSIG */
/* ========== Pio definition for PIOA peripheral ========== */
#define PIO_PA21X1_AFE0_AD1          ( 1u << 21 ) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA21X1_PIODCEN2          ( 1u << 21 ) /**< \brief Pioa signal: AFE0_AD1/PIODCEN2 */
#define PIO_PA3X1_PIODC0             ( 1u << 3 )  /**< \brief Pioa signal: PIODC0 */
#define PIO_PA10X1_PIODC4            ( 1u << 10 ) /**< \brief Pioa signal: PIODC4 */
#define PIO_PA12X1_PIODC6            ( 1u << 12 ) /**< \brief Pioa signal: PIODC6 */
#define PIO_PA13X1_PIODC7            ( 1u << 13 ) /**< \brief Pioa signal: PIODC7 */
#define PIO_PA22X1_PIODCCLK          ( 1u << 22 ) /**< \brief Pioa signal: PIODCCLK */
#define PIO_PA4X1_WKUP3              ( 1u << 4 )  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA4X1_PIODC1             ( 1u << 4 )  /**< \brief Pioa signal: WKUP3/PIODC1 */
#define PIO_PA5X1_WKUP4              ( 1u << 5 )  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA5X1_PIODC2             ( 1u << 5 )  /**< \brief Pioa signal: WKUP4/PIODC2 */
#define PIO_PA9X1_WKUP6              ( 1u << 9 )  /**< \brief Pioa signal: WKUP6/PIODC3 */
#define PIO_PA9X1_PIODC3             ( 1u << 9 )  /**< \brief Pioa signal: WKUP6/PIODC3 */
#define PIO_PA11X1_WKUP7             ( 1u << 11 ) /**< \brief Pioa signal: WKUP7/PIODC5 */
#define PIO_PA11X1_PIODC5            ( 1u << 11 ) /**< \brief Pioa signal: WKUP7/PIODC5 */
#define PIO_PA14X1_WKUP8             ( 1u << 14 ) /**< \brief Pioa signal: WKUP8/PIODCEN1 */
#define PIO_PA14X1_PIODCEN1          ( 1u << 14 ) /**< \brief Pioa signal: WKUP8/PIODCEN1 */
/* ========== Pio definition for PMC peripheral ========== */
#define PIO_PA6B_PCK0                ( 1u << 6 )  /**< \brief Pmc signal: PCK0 */
#define PIO_PB12D_PCK0               ( 1u << 12 ) /**< \brief Pmc signal: PCK0 */
#define PIO_PB13B_PCK0               ( 1u << 13 ) /**< \brief Pmc signal: PCK0 */
#define PIO_PA17B_PCK1               ( 1u << 17 ) /**< \brief Pmc signal: PCK1 */
#define PIO_PA21B_PCK1               ( 1u << 21 ) /**< \brief Pmc signal: PCK1 */
#define PIO_PA3C_PCK2                ( 1u << 3 )  /**< \brief Pmc signal: PCK2 */
#define PIO_PA18B_PCK2               ( 1u << 18 ) /**< \brief Pmc signal: PCK2 */
#define PIO_PA31B_PCK2               ( 1u << 31 ) /**< \brief Pmc signal: PCK2 */
#define PIO_PB3B_PCK2                ( 1u << 3 )  /**< \brief Pmc signal: PCK2 */
#define PIO_PD31C_PCK2               ( 1u << 31 ) /**< \brief Pmc signal: PCK2 */
/* ========== Pio definition for PWM0 peripheral ========== */
#define PIO_PA10B_PWMC0_PWMEXTRG0    ( 1u << 10 ) /**< \brief Pwm0 signal: PWMC0_PWMEXTRG0 */
#define PIO_PA22B_PWMC0_PWMEXTRG1    ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWMEXTRG1 */
#define PIO_PA9C_PWMC0_PWMFI0        ( 1u << 9 )  /**< \brief Pwm0 signal: PWMC0_PWMFI0 */
#define PIO_PD8B_PWMC0_PWMFI1        ( 1u << 8 )  /**< \brief Pwm0 signal: PWMC0_PWMFI1 */
#define PIO_PD9B_PWMC0_PWMFI2        ( 1u << 9 )  /**< \brief Pwm0 signal: PWMC0_PWMFI2 */
#define PIO_PA0A_PWMC0_PWMH0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA11B_PWMC0_PWMH0        ( 1u << 11 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA23B_PWMC0_PWMH0        ( 1u << 23 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PB0A_PWMC0_PWMH0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PD11B_PWMC0_PWMH0        ( 1u << 11 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PD20A_PWMC0_PWMH0        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWMH0 */
#define PIO_PA2A_PWMC0_PWMH1         ( 1u << 2 )  /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA12B_PWMC0_PWMH1        ( 1u << 12 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA24B_PWMC0_PWMH1        ( 1u << 24 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PB1A_PWMC0_PWMH1         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PD21A_PWMC0_PWMH1        ( 1u << 21 ) /**< \brief Pwm0 signal: PWMC0_PWMH1 */
#define PIO_PA13B_PWMC0_PWMH2        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PA25B_PWMC0_PWMH2        ( 1u << 25 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PB4B_PWMC0_PWMH2         ( 1u << 4 )  /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PC19B_PWMC0_PWMH2        ( 1u << 19 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PD22A_PWMC0_PWMH2        ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWMH2 */
#define PIO_PA7B_PWMC0_PWMH3         ( 1u << 7 )  /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA14B_PWMC0_PWMH3        ( 1u << 14 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA17C_PWMC0_PWMH3        ( 1u << 17 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PC13B_PWMC0_PWMH3        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PC21B_PWMC0_PWMH3        ( 1u << 21 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PD23A_PWMC0_PWMH3        ( 1u << 23 ) /**< \brief Pwm0 signal: PWMC0_PWMH3 */
#define PIO_PA1A_PWMC0_PWML0         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PA19B_PWMC0_PWML0        ( 1u << 19 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PB5B_PWMC0_PWML0         ( 1u << 5 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PC0B_PWMC0_PWML0         ( 1u << 0 )  /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PD10B_PWMC0_PWML0        ( 1u << 10 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PD24A_PWMC0_PWML0        ( 1u << 24 ) /**< \brief Pwm0 signal: PWMC0_PWML0 */
#define PIO_PA20B_PWMC0_PWML1        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PB12A_PWMC0_PWML1        ( 1u << 12 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PC1B_PWMC0_PWML1         ( 1u << 1 )  /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PC18B_PWMC0_PWML1        ( 1u << 18 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PD25A_PWMC0_PWML1        ( 1u << 25 ) /**< \brief Pwm0 signal: PWMC0_PWML1 */
#define PIO_PA16C_PWMC0_PWML2        ( 1u << 16 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PA30A_PWMC0_PWML2        ( 1u << 30 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PB13A_PWMC0_PWML2        ( 1u << 13 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PC2B_PWMC0_PWML2         ( 1u << 2 )  /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PC20B_PWMC0_PWML2        ( 1u << 20 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PD26A_PWMC0_PWML2        ( 1u << 26 ) /**< \brief Pwm0 signal: PWMC0_PWML2 */
#define PIO_PA15C_PWMC0_PWML3        ( 1u << 15 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC3B_PWMC0_PWML3         ( 1u << 3 )  /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC15B_PWMC0_PWML3        ( 1u << 15 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PC22B_PWMC0_PWML3        ( 1u << 22 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
#define PIO_PD27A_PWMC0_PWML3        ( 1u << 27 ) /**< \brief Pwm0 signal: PWMC0_PWML3 */
/* ========== Pio definition for PWM1 peripheral ========== */
#define PIO_PA30B_PWMC1_PWMEXTRG0    ( 1u << 30 ) /**< \brief Pwm1 signal: PWMC1_PWMEXTRG0 */
#define PIO_PA18A_PWMC1_PWMEXTRG1    ( 1u << 18 ) /**< \brief Pwm1 signal: PWMC1_PWMEXTRG1 */
#define PIO_PA21C_PWMC1_PWMFI0       ( 1u << 21 ) /**< \brief Pwm1 signal: PWMC1_PWMFI0 */
#define PIO_PA26D_PWMC1_PWMFI1       ( 1u << 26 ) /**< \brief Pwm1 signal: PWMC1_PWMFI1 */
#define PIO_PA28D_PWMC1_PWMFI2       ( 1u << 28 ) /**< \brief Pwm1 signal: PWMC1_PWMFI2 */
#define PIO_PA12C_PWMC1_PWMH0        ( 1u << 12 ) /**< \brief Pwm1 signal: PWMC1_PWMH0 */
#define PIO_PD1B_PWMC1_PWMH0         ( 1u << 1 )  /**< \brief Pwm1 signal: PWMC1_PWMH0 */
#define PIO_PA14C_PWMC1_PWMH1        ( 1u << 14 ) /**< \brief Pwm1 signal: PWMC1_PWMH1 */
#define PIO_PD3B_PWMC1_PWMH1         ( 1u << 3 )  /**< \brief Pwm1 signal: PWMC1_PWMH1 */
#define PIO_PA31D_PWMC1_PWMH2        ( 1u << 31 ) /**< \brief Pwm1 signal: PWMC1_PWMH2 */
#define PIO_PD5B_PWMC1_PWMH2         ( 1u << 5 )  /**< \brief Pwm1 signal: PWMC1_PWMH2 */
#define PIO_PA8A_PWMC1_PWMH3         ( 1u << 8 )  /**< \brief Pwm1 signal: PWMC1_PWMH3 */
#define PIO_PD7B_PWMC1_PWMH3         ( 1u << 7 )  /**< \brief Pwm1 signal: PWMC1_PWMH3 */
#define PIO_PA11C_PWMC1_PWML0        ( 1u << 11 ) /**< \brief Pwm1 signal: PWMC1_PWML0 */
#define PIO_PD0B_PWMC1_PWML0         ( 1u << 0 )  /**< \brief Pwm1 signal: PWMC1_PWML0 */
#define PIO_PA13C_PWMC1_PWML1        ( 1u << 13 ) /**< \brief Pwm1 signal: PWMC1_PWML1 */
#define PIO_PD2B_PWMC1_PWML1         ( 1u << 2 )  /**< \brief Pwm1 signal: PWMC1_PWML1 */
#define PIO_PA23D_PWMC1_PWML2        ( 1u << 23 ) /**< \brief Pwm1 signal: PWMC1_PWML2 */
#define PIO_PD4B_PWMC1_PWML2         ( 1u << 4 )  /**< \brief Pwm1 signal: PWMC1_PWML2 */
#define PIO_PA5A_PWMC1_PWML3         ( 1u << 5 )  /**< \brief Pwm1 signal: PWMC1_PWML3 */
#define PIO_PD6B_PWMC1_PWML3         ( 1u << 6 )  /**< \brief Pwm1 signal: PWMC1_PWML3 */
/* ========== Pio definition for QSPI peripheral ========== */
#define PIO_PA11A_QCS                ( 1u << 11 ) /**< \brief Qspi signal: QCS */
#define PIO_PA13A_QIO0               ( 1u << 13 ) /**< \brief Qspi signal: QIO0 */
#define PIO_PA12A_QIO1               ( 1u << 12 ) /**< \brief Qspi signal: QIO1 */
#define PIO_PA17A_QIO2               ( 1u << 17 ) /**< \brief Qspi signal: QIO2 */
#define PIO_PD31A_QIO3               ( 1u << 31 ) /**< \brief Qspi signal: QIO3 */
#define PIO_PA14A_QSCK               ( 1u << 14 ) /**< \brief Qspi signal: QSCK */
/* ========== Pio definition for SPI0 peripheral ========== */
#define PIO_PD20B_SPI0_MISO          ( 1u << 20 ) /**< \brief Spi0 signal: SPI0_MISO */
#define PIO_PD21B_SPI0_MOSI          ( 1u << 21 ) /**< \brief Spi0 signal: SPI0_MOSI */
#define PIO_PB2D_SPI0_NPCS0          ( 1u << 2 )  /**< \brief Spi0 signal: SPI0_NPCS0 */
#define PIO_PA31A_SPI0_NPCS1         ( 1u << 31 ) /**< \brief Spi0 signal: SPI0_NPCS1 */
#define PIO_PD25B_SPI0_NPCS1         ( 1u << 25 ) /**< \brief Spi0 signal: SPI0_NPCS1 */
#define PIO_PD12C_SPI0_NPCS2         ( 1u << 12 ) /**< \brief Spi0 signal: SPI0_NPCS2 */
#define PIO_PD27B_SPI0_NPCS3         ( 1u << 27 ) /**< \brief Spi0 signal: SPI0_NPCS3 */
#define PIO_PD22B_SPI0_SPCK          ( 1u << 22 ) /**< \brief Spi0 signal: SPI0_SPCK */
/* ========== Pio definition for SPI1 peripheral ========== */
#define PIO_PC26C_SPI1_MISO          ( 1u << 26 ) /**< \brief Spi1 signal: SPI1_MISO */
#define PIO_PC27C_SPI1_MOSI          ( 1u << 27 ) /**< \brief Spi1 signal: SPI1_MOSI */
#define PIO_PC25C_SPI1_NPCS0         ( 1u << 25 ) /**< \brief Spi1 signal: SPI1_NPCS0 */
#define PIO_PC28C_SPI1_NPCS1         ( 1u << 28 ) /**< \brief Spi1 signal: SPI1_NPCS1 */
#define PIO_PD0C_SPI1_NPCS1          ( 1u << 0 )  /**< \brief Spi1 signal: SPI1_NPCS1 */
#define PIO_PC29C_SPI1_NPCS2         ( 1u << 29 ) /**< \brief Spi1 signal: SPI1_NPCS2 */
#define PIO_PD1C_SPI1_NPCS2          ( 1u << 1 )  /**< \brief Spi1 signal: SPI1_NPCS2 */
#define PIO_PC30C_SPI1_NPCS3         ( 1u << 30 ) /**< \brief Spi1 signal: SPI1_NPCS3 */
#define PIO_PD2C_SPI1_NPCS3          ( 1u << 2 )  /**< \brief Spi1 signal: SPI1_NPCS3 */
#define PIO_PC24C_SPI1_SPCK          ( 1u << 24 ) /**< \brief Spi1 signal: SPI1_SPCK */
/* ========== Pio definition for SSC peripheral ========== */
#define PIO_PA10C_RD                 ( 1u << 10 ) /**< \brief Ssc signal: RD */
#define PIO_PD24B_RF                 ( 1u << 24 ) /**< \brief Ssc signal: RF */
#define PIO_PA22A_RK                 ( 1u << 22 ) /**< \brief Ssc signal: RK */
#define PIO_PB5D_TD                  ( 1u << 5 )  /**< \brief Ssc signal: TD */
#define PIO_PD10C_TD                 ( 1u << 10 ) /**< \brief Ssc signal: TD */
#define PIO_PD26B_TD                 ( 1u << 26 ) /**< \brief Ssc signal: TD */
#define PIO_PB0D_TF                  ( 1u << 0 )  /**< \brief Ssc signal: TF */
#define PIO_PB1D_TK                  ( 1u << 1 )  /**< \brief Ssc signal: TK */
/* ========== Pio definition for TC0 peripheral ========== */
#define PIO_PA4B_TCLK0               ( 1u << 4 )  /**< \brief Tc0 signal: TCLK0 */
#define PIO_PA28B_TCLK1              ( 1u << 28 ) /**< \brief Tc0 signal: TCLK1 */
#define PIO_PA29B_TCLK2              ( 1u << 29 ) /**< \brief Tc0 signal: TCLK2 */
#define PIO_PA0B_TIOA0               ( 1u << 0 )  /**< \brief Tc0 signal: TIOA0 */
#define PIO_PA15B_TIOA1              ( 1u << 15 ) /**< \brief Tc0 signal: TIOA1 */
#define PIO_PA26B_TIOA2              ( 1u << 26 ) /**< \brief Tc0 signal: TIOA2 */
#define PIO_PA1B_TIOB0               ( 1u << 1 )  /**< \brief Tc0 signal: TIOB0 */
#define PIO_PA16B_TIOB1              ( 1u << 16 ) /**< \brief Tc0 signal: TIOB1 */
#define PIO_PA27B_TIOB2              ( 1u << 27 ) /**< \brief Tc0 signal: TIOB2 */
/* ========== Pio definition for TC1 peripheral ========== */
#define PIO_PC25B_TCLK3              ( 1u << 25 ) /**< \brief Tc1 signal: TCLK3 */
#define PIO_PC28B_TCLK4              ( 1u << 28 ) /**< \brief Tc1 signal: TCLK4 */
#define PIO_PC31B_TCLK5              ( 1u << 31 ) /**< \brief Tc1 signal: TCLK5 */
#define PIO_PC23B_TIOA3              ( 1u << 23 ) /**< \brief Tc1 signal: TIOA3 */
#define PIO_PC26B_TIOA4              ( 1u << 26 ) /**< \brief Tc1 signal: TIOA4 */
#define PIO_PC29B_TIOA5              ( 1u << 29 ) /**< \brief Tc1 signal: TIOA5 */
#define PIO_PC24B_TIOB3              ( 1u << 24 ) /**< \brief Tc1 signal: TIOB3 */
#define PIO_PC27B_TIOB4              ( 1u << 27 ) /**< \brief Tc1 signal: TIOB4 */
#define PIO_PC30B_TIOB5              ( 1u << 30 ) /**< \brief Tc1 signal: TIOB5 */
/* ========== Pio definition for TC2 peripheral ========== */
#define PIO_PC7B_TCLK6               ( 1u << 7 )  /**< \brief Tc2 signal: TCLK6 */
#define PIO_PC10B_TCLK7              ( 1u << 10 ) /**< \brief Tc2 signal: TCLK7 */
#define PIO_PC14B_TCLK8              ( 1u << 14 ) /**< \brief Tc2 signal: TCLK8 */
#define PIO_PC5B_TIOA6               ( 1u << 5 )  /**< \brief Tc2 signal: TIOA6 */
#define PIO_PC8B_TIOA7               ( 1u << 8 )  /**< \brief Tc2 signal: TIOA7 */
#define PIO_PC11B_TIOA8              ( 1u << 11 ) /**< \brief Tc2 signal: TIOA8 */
#define PIO_PC6B_TIOB6               ( 1u << 6 )  /**< \brief Tc2 signal: TIOB6 */
#define PIO_PC9B_TIOB7               ( 1u << 9 )  /**< \brief Tc2 signal: TIOB7 */
#define PIO_PC12B_TIOB8              ( 1u << 12 ) /**< \brief Tc2 signal: TIOB8 */
/* ========== Pio definition for TC3 peripheral ========== */
#define PIO_PE5B_TCLK10              ( 1u << 5 )  /**< \brief Tc3 signal: TCLK10 */
#define PIO_PD24C_TCLK11             ( 1u << 24 ) /**< \brief Tc3 signal: TCLK11 */
#define PIO_PE2B_TCLK9               ( 1u << 2 )  /**< \brief Tc3 signal: TCLK9 */
#define PIO_PE3B_TIOA10              ( 1u << 3 )  /**< \brief Tc3 signal: TIOA10 */
#define PIO_PD21C_TIOA11             ( 1u << 21 ) /**< \brief Tc3 signal: TIOA11 */
#define PIO_PE0B_TIOA9               ( 1u << 0 )  /**< \brief Tc3 signal: TIOA9 */
#define PIO_PE4B_TIOB10              ( 1u << 4 )  /**< \brief Tc3 signal: TIOB10 */
#define PIO_PD22C_TIOB11             ( 1u << 22 ) /**< \brief Tc3 signal: TIOB11 */
#define PIO_PE1B_TIOB9               ( 1u << 1 )  /**< \brief Tc3 signal: TIOB9 */
/* ========== Pio definition for TWIHS0 peripheral ========== */
#define PIO_PA4A_TWCK0               ( 1u << 4 )  /**< \brief Twihs0 signal: TWCK0 */
#define PIO_PA3A_TWD0                ( 1u << 3 )  /**< \brief Twihs0 signal: TWD0 */
/* ========== Pio definition for TWIHS1 peripheral ========== */
#define PIO_PB5A_TWCK1               ( 1u << 5 )  /**< \brief Twihs1 signal: TWCK1 */
#define PIO_PB4A_TWD1                ( 1u << 4 )  /**< \brief Twihs1 signal: TWD1 */
/* ========== Pio definition for TWIHS2 peripheral ========== */
#define PIO_PD28C_TWCK2              ( 1u << 28 ) /**< \brief Twihs2 signal: TWCK2 */
#define PIO_PD27C_TWD2               ( 1u << 27 ) /**< \brief Twihs2 signal: TWD2 */
/* ========== Pio definition for UART0 peripheral ========== */
#define PIO_PA9A_URXD0               ( 1u << 9 )  /**< \brief Uart0 signal: URXD0 */
#define PIO_PA10A_UTXD0              ( 1u << 10 ) /**< \brief Uart0 signal: UTXD0 */
/* ========== Pio definition for UART1 peripheral ========== */
#define PIO_PA5C_URXD1               ( 1u << 5 )  /**< \brief Uart1 signal: URXD1 */
#define PIO_PA4C_UTXD1               ( 1u << 4 )  /**< \brief Uart1 signal: UTXD1 */
#define PIO_PA6C_UTXD1               ( 1u << 6 )  /**< \brief Uart1 signal: UTXD1 */
#define PIO_PD26D_UTXD1              ( 1u << 26 ) /**< \brief Uart1 signal: UTXD1 */
/* ========== Pio definition for UART2 peripheral ========== */
#define PIO_PD25C_URXD2              ( 1u << 25 ) /**< \brief Uart2 signal: URXD2 */
#define PIO_PD26C_UTXD2              ( 1u << 26 ) /**< \brief Uart2 signal: UTXD2 */
/* ========== Pio definition for UART3 peripheral ========== */
#define PIO_PD28A_URXD3              ( 1u << 28 ) /**< \brief Uart3 signal: URXD3 */
#define PIO_PD30A_UTXD3              ( 1u << 30 ) /**< \brief Uart3 signal: UTXD3 */
#define PIO_PD31B_UTXD3              ( 1u << 31 ) /**< \brief Uart3 signal: UTXD3 */
/* ========== Pio definition for UART4 peripheral ========== */
#define PIO_PD18C_URXD4              ( 1u << 18 ) /**< \brief Uart4 signal: URXD4 */
#define PIO_PD3C_UTXD4               ( 1u << 3 )  /**< \brief Uart4 signal: UTXD4 */
#define PIO_PD19C_UTXD4              ( 1u << 19 ) /**< \brief Uart4 signal: UTXD4 */
/* ========== Pio definition for USART0 peripheral ========== */
#define PIO_PB2C_CTS0                ( 1u << 2 )  /**< \brief Usart0 signal: CTS0 */
#define PIO_PD0D_DCD0                ( 1u << 0 )  /**< \brief Usart0 signal: DCD0 */
#define PIO_PD2D_DSR0                ( 1u << 2 )  /**< \brief Usart0 signal: DSR0 */
#define PIO_PD1D_DTR0                ( 1u << 1 )  /**< \brief Usart0 signal: DTR0 */
#define PIO_PD3D_RI0                 ( 1u << 3 )  /**< \brief Usart0 signal: RI0 */
#define PIO_PB3C_RTS0                ( 1u << 3 )  /**< \brief Usart0 signal: RTS0 */
#define PIO_PB0C_RXD0                ( 1u << 0 )  /**< \brief Usart0 signal: RXD0 */
#define PIO_PB13C_SCK0               ( 1u << 13 ) /**< \brief Usart0 signal: SCK0 */
#define PIO_PB1C_TXD0                ( 1u << 1 )  /**< \brief Usart0 signal: TXD0 */
/* ========== Pio definition for USART1 peripheral ========== */
#define PIO_PA25A_CTS1               ( 1u << 25 ) /**< \brief Usart1 signal: CTS1 */
#define PIO_PA26A_DCD1               ( 1u << 26 ) /**< \brief Usart1 signal: DCD1 */
#define PIO_PA28A_DSR1               ( 1u << 28 ) /**< \brief Usart1 signal: DSR1 */
#define PIO_PA27A_DTR1               ( 1u << 27 ) /**< \brief Usart1 signal: DTR1 */
#define PIO_PA3B_LONCOL1             ( 1u << 3 )  /**< \brief Usart1 signal: LONCOL1 */
#define PIO_PA29A_RI1                ( 1u << 29 ) /**< \brief Usart1 signal: RI1 */
#define PIO_PA24A_RTS1               ( 1u << 24 ) /**< \brief Usart1 signal: RTS1 */
#define PIO_PA21A_RXD1               ( 1u << 21 ) /**< \brief Usart1 signal: RXD1 */
#define PIO_PA23A_SCK1               ( 1u << 23 ) /**< \brief Usart1 signal: SCK1 */
#define PIO_PB4D_TXD1                ( 1u << 4 )  /**< \brief Usart1 signal: TXD1 */
/* ========== Pio definition for USART2 peripheral ========== */
#define PIO_PD19B_CTS2               ( 1u << 19 ) /**< \brief Usart2 signal: CTS2 */
#define PIO_PD4D_DCD2                ( 1u << 4 )  /**< \brief Usart2 signal: DCD2 */
#define PIO_PD6D_DSR2                ( 1u << 6 )  /**< \brief Usart2 signal: DSR2 */
#define PIO_PD5D_DTR2                ( 1u << 5 )  /**< \brief Usart2 signal: DTR2 */
#define PIO_PD7D_RI2                 ( 1u << 7 )  /**< \brief Usart2 signal: RI2 */
#define PIO_PD18B_RTS2               ( 1u << 18 ) /**< \brief Usart2 signal: RTS2 */
#define PIO_PD15B_RXD2               ( 1u << 15 ) /**< \brief Usart2 signal: RXD2 */
#define PIO_PD17B_SCK2               ( 1u << 17 ) /**< \brief Usart2 signal: SCK2 */
#define PIO_PD16B_TXD2               ( 1u << 16 ) /**< \brief Usart2 signal: TXD2 */
/* ========== Pio indexes ========== */
#define PIO_PA0_IDX                  0
#define PIO_PA1_IDX                  1
#define PIO_PA2_IDX                  2
#define PIO_PA3_IDX                  3
#define PIO_PA4_IDX                  4
#define PIO_PA5_IDX                  5
#define PIO_PA6_IDX                  6
#define PIO_PA7_IDX                  7
#define PIO_PA8_IDX                  8
#define PIO_PA9_IDX                  9
#define PIO_PA10_IDX                 10
#define PIO_PA11_IDX                 11
#define PIO_PA12_IDX                 12
#define PIO_PA13_IDX                 13
#define PIO_PA14_IDX                 14
#define PIO_PA15_IDX                 15
#define PIO_PA16_IDX                 16
#define PIO_PA17_IDX                 17
#define PIO_PA18_IDX                 18
#define PIO_PA19_IDX                 19
#define PIO_PA20_IDX                 20
#define PIO_PA21_IDX                 21
#define PIO_PA22_IDX                 22
#define PIO_PA23_IDX                 23
#define PIO_PA24_IDX                 24
#define PIO_PA25_IDX                 25
#define PIO_PA26_IDX                 26
#define PIO_PA27_IDX                 27
#define PIO_PA28_IDX                 28
