FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/pio/pio_samv71q21.h
#define PIO_PA29_IDX                 29
#define PIO_PA30_IDX                 30
#define PIO_PA31_IDX                 31
#define PIO_PB0_IDX                  32
#define PIO_PB1_IDX                  33
#define PIO_PB2_IDX                  34
#define PIO_PB3_IDX                  35
#define PIO_PB4_IDX                  36
#define PIO_PB5_IDX                  37
#define PIO_PB6_IDX                  38
#define PIO_PB7_IDX                  39
#define PIO_PB8_IDX                  40
#define PIO_PB9_IDX                  41
#define PIO_PB12_IDX                 44
#define PIO_PB13_IDX                 45
#define PIO_PC0_IDX                  64
#define PIO_PC1_IDX                  65
#define PIO_PC2_IDX                  66
#define PIO_PC3_IDX                  67
#define PIO_PC4_IDX                  68
#define PIO_PC5_IDX                  69
#define PIO_PC6_IDX                  70
#define PIO_PC7_IDX                  71
#define PIO_PC8_IDX                  72
#define PIO_PC9_IDX                  73
#define PIO_PC10_IDX                 74
#define PIO_PC11_IDX                 75
#define PIO_PC12_IDX                 76
#define PIO_PC13_IDX                 77
#define PIO_PC14_IDX                 78
#define PIO_PC15_IDX                 79
#define PIO_PC16_IDX                 80
#define PIO_PC17_IDX                 81
#define PIO_PC18_IDX                 82
#define PIO_PC19_IDX                 83
#define PIO_PC20_IDX                 84
#define PIO_PC21_IDX                 85
#define PIO_PC22_IDX                 86
#define PIO_PC23_IDX                 87
#define PIO_PC24_IDX                 88
#define PIO_PC25_IDX                 89
#define PIO_PC26_IDX                 90
#define PIO_PC27_IDX                 91
#define PIO_PC28_IDX                 92
#define PIO_PC29_IDX                 93
#define PIO_PC30_IDX                 94
#define PIO_PC31_IDX                 95
#define PIO_PD0_IDX                  96
#define PIO_PD1_IDX                  97
#define PIO_PD2_IDX                  98
#define PIO_PD3_IDX                  99
#define PIO_PD4_IDX                  100
#define PIO_PD5_IDX                  101
#define PIO_PD6_IDX                  102
#define PIO_PD7_IDX                  103
#define PIO_PD8_IDX                  104
#define PIO_PD9_IDX                  105
#define PIO_PD10_IDX                 106
#define PIO_PD11_IDX                 107
#define PIO_PD12_IDX                 108
#define PIO_PD13_IDX                 109
#define PIO_PD14_IDX                 110
#define PIO_PD15_IDX                 111
#define PIO_PD16_IDX                 112
#define PIO_PD17_IDX                 113
#define PIO_PD18_IDX                 114
#define PIO_PD19_IDX                 115
#define PIO_PD20_IDX                 116
#define PIO_PD21_IDX                 117
#define PIO_PD22_IDX                 118
#define PIO_PD23_IDX                 119
#define PIO_PD24_IDX                 120
#define PIO_PD25_IDX                 121
#define PIO_PD26_IDX                 122
#define PIO_PD27_IDX                 123
#define PIO_PD28_IDX                 124
#define PIO_PD29_IDX                 125
#define PIO_PD30_IDX                 126
#define PIO_PD31_IDX                 127
#define PIO_PE0_IDX                  128
#define PIO_PE1_IDX                  129
#define PIO_PE2_IDX                  130
#define PIO_PE3_IDX                  131
#define PIO_PE4_IDX                  132
#define PIO_PE5_IDX                  133

#endif /* _SAMV71Q21_PIO_ */
